from django.db import models  # Імпортуємо модулі для роботи з моделями Django

# Моделі потрібні для опису структури даних, які зберігаються у базі даних.
# Вони дозволяють легко працювати з даними через ORM Django, створювати, змінювати та отримувати записи.


# Оголошуємо модель Form, яка буде представляти форму заявки на роботу
class Form(models.Model):
    # Поле для збереження імені користувача (максимум 80 символів)
    first_name = models.CharField(max_length=80)
    # Поле для збереження прізвища користувача (максимум 80 символів)
    last_name = models.CharField(max_length=80)
    # Поле для збереження email-адреси користувача
    email = models.EmailField()
    # Поле для збереження дати подачі заявки
    date = models.DateField()
    # Поле для збереження професії або зайнятості користувача (максимум 200 символів)
    occupation = models.CharField(max_length=200)

    # Метод, який повертає рядкове представлення об'єкта (ім'я та прізвище) Відобрадається у адмінці Django
    def __str__(self):
        return f"{self.first_name} {self.last_name}"
